app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
    def index
        @tasks = Task.all

INSERT INTO "tasks" ("name", "due_date", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "go home"], ["due_date", "2017-02-03"], ["note", "teats"], ["created_at", "2017-11-20 05:57:23.396754"], ["updated_at", "2017-11-20 05:57:23.396754"]]
---
    def create
		@task = Task.new(task_params)
		if @task.save

UPDATE "tasks" SET "due_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["due_date", "2017-03-27"], ["updated_at", "2017-11-20 06:49:06.060805"], ["id", 2]]
---
	def update
		set_task

		if @task.update_attributes(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
	def destroy
		set_task
		@task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_task
	@task = Task.find(params[:id])